app/controllers/cart_products_controller.rb

  def update
    if @cart_product.update(cart_product_params)
---
UPDATE "cart_products" SET "quantity" = ?, "updated_at" = ? WHERE "cart_products"."id" = ?  [["quantity", 4], ["updated_at", "2020-06-18 17:42:20.979758"], ["id", 13]]