app/controllers/cart_products_controller.rb

SELECT "cart_products".* FROM "cart_products"
SELECT "products".* FROM "products"
---
  def index
    @cart_products = CartProduct.all

INSERT INTO "cart_products" ("product_id", "cart_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["product_id", 4], ["cart_id", 1], ["created_at", "2020-06-17 20:38:35.377705"], ["updated_at", "2020-06-17 20:38:35.377705"]]
---
  def create
    @cart_product = CartProduct.new(cart_product_params)

    if @cart_product.save

UPDATE "cart_products" SET "quantity" = ?, "updated_at" = ? WHERE "cart_products"."id" = ?  [["quantity", 3], ["updated_at", "2020-06-18 03:56:24.347994"], ["id", 3]]
---
  def update
    if @cart_product.update(cart_product_params)

DELETE FROM "cart_products" WHERE "cart_products"."id" = ?  [["id", 14]]
---
  def destroy
    @cart_product.destroy

SELECT "cart_products".* FROM "cart_products" WHERE "cart_products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]
---
    def set_cart_product
      @cart_product = CartProduct.find(params[:id])