app/controllers/products_controller.rb

SELECT "cart_products".* FROM "cart_products"
SELECT "products".* FROM "products"
---
  def index
    @products = Product.all

INSERT INTO "products" ("name", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Potatoe"], ["price", 1.26], ["created_at", "2020-06-17 22:58:15.779496"], ["updated_at", "2020-06-17 22:58:15.779496"]]
---
  def create
    @product = Product.new(product_params)

    if @product.save